gcg=figure;
set(gcf,'Position',[400,100,400,200])
% load('Compare1.mat')%采取归一化
% plot([7:2:15],[0.8538 0.8825 0.8508 0.8573 0.8335 ],'bo:');
% plot([7:2:15],[0.8430 0.8722 0.8531 0.8233 0.7754],'b','LineWidth',2);
a1=[78.48 88.71 95.38 97.46 98.68 98.68 98.55 98.65];
plot([5:4:33],a1,'bo-','LineWidth',2)
hold on
% plot([7:2:15],[0.7606 0.7590 0.7574 0.7722 0.7607],'r--');
% a2=[0.760633333333333	0.757416666666667	0.772183333333333	0.76065	0.758];
% plot([7:2:15],a2*100,'rx-');
legend('SSN','Location','SouthEast');
xlabel('Spatial size');
ylabel('Recognition accuracy (%)');
axis([5 35 75 100]);


gcg=figure;
set(gcf,'Position',[400,100,400,200])
% load('Compare1.mat')%采取归一化
% plot([7:2:15],[0.8538 0.8825 0.8508 0.8573 0.8335 ],'bo:');
% plot([7:2:15],[0.8430 0.8722 0.8531 0.8233 0.7754],'b','LineWidth',2);

a1=[96.43    97.44    97.68    97.74    97.82    97.84    98.15   98.23];

a2=[97.90    98.01    98.25    98.21   98.28    98.29    98.25    98.42];

a3=[97.89    98.13    98.49    98.64    98.55    98.33    98.67   98.53];

a4=[98.02    98.55    98.43    98.55    98.65    98.51   98.48    98.44];

plot([10:10:80],a1,'bo-','LineWidth',2)
hold on
plot([10:10:80],a2,'r--','LineWidth',2)
plot([10:10:80],a3,'gx-','LineWidth',2);
plot([10:10:80],a4,'k+-','LineWidth',2);
% a2=[0.760633333333333	0.757416666666667	0.772183333333333	0.76065	0.758];
% plot([7:2:15],a2*100,'rx-');
legend('K_2=5','K_2=10','K_2=15','K_2=20','Location','SouthEast');
xlabel('K_1');
ylabel('Recognition accuracy (%)');
axis([10 80 90 99.5]);


% gcg=figure;
% set(gcf,'Position',[400,100,400,177])
% % load('Compare1.mat')%采取归一化
% % plot([7:2:15],[0.8538 0.8825 0.8508 0.8573 0.8335 ],'bo:');
% % plot([7:2:15],[0.8430 0.8722 0.8531 0.8233 0.7754],'b','LineWidth',2);
% plot([2:1:5],[0.86515	0.889542857142857	0.900177777777778	0.909013333333333],'bo-','LineWidth',2)
% hold on
% % plot([7:2:15],[0.7606 0.7590 0.7574 0.7722 0.7607],'r--');
% plot([2:1:5],[0.772183333333333	0.793714285714286	0.8042	0.812186666666666],'rx-');
% legend('Our method','Randomly choosing','Location','SouthEast');
% xlabel('The number of training samples of each person');
% ylabel('Rcognition accuracy');
% axis([2 5 0.65 0.95]);